IzeroCs/HomeThread/ESP-Thread/Thread-Host/sdkconfig.defaults
# Thread Border Router: ESP32-S3 Host + ESP32-H2 RCP, UART only. Không WiFi/Ethernet.
# RCP: UART 460800, GPIO4 (RX), GPIO5 (TX).

CONFIG_IDF_TARGET="esp32s3"

#
# Serial flasher
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# Custom header: bật để include br_custom_config.h (SRP server + CLI srp server/srp client)
CONFIG_OPENTHREAD_HEADER_CUSTOM=y
CONFIG_OPENTHREAD_CUSTOM_HEADER_PATH="include"
CONFIG_OPENTHREAD_CUSTOM_HEADER_FILE_NAME="br_custom_config.h"

#
# Compiler
#
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

#
# mbedTLS (Thread/DTLS)
#
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y

#
# OpenThread
#
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_BORDER_AGENT_ENABLE=y
CONFIG_OPENTHREAD_COMMISSIONER=y
CONFIG_OPENTHREAD_CLI_OTA=n
CONFIG_OPENTHREAD_RCP_COMMAND=y
CONFIG_OPENTHREAD_RADIO_SPINEL_UART=y
CONFIG_OPENTHREAD_RADIO_TREL=n
CONFIG_OPENTHREAD_TASK_SIZE=8192
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_SRP_CLIENT_MAX_SERVICES=5

#
# OpenThread Border Router Example
#
CONFIG_ESP_BR_H2_TARGET=y

#
# lwIP
#
CONFIG_LWIP_IPV6_FORWARD=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_HOOK_IP6_INPUT_CUSTOM=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_HOOK_IP6_SELECT_SRC_ADDR_CUSTOM=y
CONFIG_LWIP_FORCE_ROUTER_FORWARDING=y

#
# ESP System
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

#
# Border Router board / console
#
CONFIG_ESP_BR_BOARD_DEV_KIT=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
# CONFIG_ESP_CONSOLE_USB_CDC is not set
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
# USB CDC dùng cho frame only; log/console chỉ ra UART (không output ra USB)

#
# UART Host–RCP (ESP32-S3: GPIO4=RX, GPIO5=TX recommended)
#
CONFIG_PIN_TO_RCP_TX=4
CONFIG_PIN_TO_RCP_RX=5

#
# RCP update pins (adjust to your wiring)
#
CONFIG_PIN_TO_RCP_RESET=7
CONFIG_PIN_TO_RCP_BOOT=8

#
# HTTP server
#
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
